In [5]:
import numpy as np
import pandas as pd

In [7]:
df = pd.read_csv('spam.csv', encoding='iso-8859-1')

In [8]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
2908,spam,URGENT! Your Mobile number has been awarded wi...,NaN,NaN,NaN
728,ham,Exactly. Anyways how far. Is jide her to study...,NaN,NaN,NaN
4598,ham,Have you laid your airtel line to rest?,NaN,NaN,NaN
3409,ham,Joy's father is John. Then John is the ____ of...,NaN,NaN,NaN
413,ham,Bring home some Wendy =D,NaN,NaN,NaN

In [9]:
df.shape

(5572, 5)

In [ ]:
# Start

## 1. Data Cleaning

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [11]:
#drop last 3 col
df.drop(columns=['Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4'], inplace = True)

In [14]:
df.sample(5)

     target                                               text
4741    ham              Ya very nice. . .be ready on thursday
314     ham          You made my day. Do have a great day too.
773     ham  I wil be there with in  &lt;#&gt;  minutes. Go...
3328    ham    Sac will score big hundred.he is set batsman:-)
4095    ham  Hey , is * rite u put åÈ10 evey mnth is that all?

In [13]:
#remane col
df.rename(columns = {'v1':'target', 'v2':'text'}, inplace=True)

In [15]:
df.sample(5)

     target                                               text
5014    ham  I think the other two still need to get cash b...
442     ham  Oic... I saw him too but i tot he din c me... ...
2227    ham                   Oh k.k..where did you take test?
157     ham  Hello, my love. What are you doing? Did you ge...
3354    ham                      Minimum walk is 3miles a day.

In [16]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [18]:
df['target'] = encoder.fit_transform(df['target'])

In [19]:
df.sample(5)

      target                                               text
4925       0   Oh yes, why is it like torture watching england?
2261       0  Did you show him and wot did he say or could u...
806        0   sure, but make sure he knows we ain't smokin yet
2182       0                   PS U no ur a grown up now right?
377        0  Well there's not a lot of things happening in ...

In [20]:
df.head()

   target                                               text
0       0  Go until jurong point, crazy.. Available only ...
1       0                      Ok lar... Joking wif u oni...
2       1  Free entry in 2 a wkly comp to win FA Cup fina...
3       0  U dun say so early hor... U c already then say...
4       0  Nah I don't think he goes to usf, he lives aro...

In [21]:
#missing Values
df.isnull().sum()

target    0
text      0
dtype: int64

In [23]:
#check for dunlicate values
df.duplicated().sum()

403

In [25]:
#remove duplicates
df = df.drop_duplicates(keep = 'first')

In [26]:
df.duplicated().sum()

0

In [27]:
df.shape

(5169, 2)

## 2.EDA